Microchip-MPLAB-Harmony/csp/apps/mcan/mcan_normal_operation_interrupt/firmware/src/packs/ATSAMA5D27_DFP/component/adc.h
/* -------- ADC_YPOSR : (ADC Offset: 0xB8) ( R/ 32) Touchscreen Y Position Register -------- */
#define ADC_YPOSR_YPOS_Pos                    _U_(0)                                               /**< (ADC_YPOSR) Y Position Position */
#define ADC_YPOSR_YPOS_Msk                    (_U_(0xFFF) << ADC_YPOSR_YPOS_Pos)                   /**< (ADC_YPOSR) Y Position Mask */
#define ADC_YPOSR_YPOS(value)                 (ADC_YPOSR_YPOS_Msk & ((value) << ADC_YPOSR_YPOS_Pos))
#define ADC_YPOSR_YSCALE_Pos                  _U_(16)                                              /**< (ADC_YPOSR) Scale of YPOS Position */
#define ADC_YPOSR_YSCALE_Msk                  (_U_(0xFFF) << ADC_YPOSR_YSCALE_Pos)                 /**< (ADC_YPOSR) Scale of YPOS Mask */
#define ADC_YPOSR_YSCALE(value)               (ADC_YPOSR_YSCALE_Msk & ((value) << ADC_YPOSR_YSCALE_Pos))
#define ADC_YPOSR_Msk                         _U_(0x0FFF0FFF)                                      /**< (ADC_YPOSR) Register Mask  */


/* -------- ADC_PRESSR : (ADC Offset: 0xBC) ( R/ 32) Touchscreen Pressure Register -------- */
#define ADC_PRESSR_Z1_Pos                     _U_(0)                                               /**< (ADC_PRESSR) Data of Z1 Measurement Position */
#define ADC_PRESSR_Z1_Msk                     (_U_(0xFFF) << ADC_PRESSR_Z1_Pos)                    /**< (ADC_PRESSR) Data of Z1 Measurement Mask */
#define ADC_PRESSR_Z1(value)                  (ADC_PRESSR_Z1_Msk & ((value) << ADC_PRESSR_Z1_Pos))
#define ADC_PRESSR_Z2_Pos                     _U_(16)                                              /**< (ADC_PRESSR) Data of Z2 Measurement Position */
#define ADC_PRESSR_Z2_Msk                     (_U_(0xFFF) << ADC_PRESSR_Z2_Pos)                    /**< (ADC_PRESSR) Data of Z2 Measurement Mask */
#define ADC_PRESSR_Z2(value)                  (ADC_PRESSR_Z2_Msk & ((value) << ADC_PRESSR_Z2_Pos))
#define ADC_PRESSR_Msk                        _U_(0x0FFF0FFF)                                      /**< (ADC_PRESSR) Register Mask  */


/* -------- ADC_TRGR : (ADC Offset: 0xC0) (R/W 32) Trigger Register -------- */
#define ADC_TRGR_TRGMOD_Pos                   _U_(0)                                               /**< (ADC_TRGR) Trigger Mode Position */
#define ADC_TRGR_TRGMOD_Msk                   (_U_(0x7) << ADC_TRGR_TRGMOD_Pos)                    /**< (ADC_TRGR) Trigger Mode Mask */
#define ADC_TRGR_TRGMOD(value)                (ADC_TRGR_TRGMOD_Msk & ((value) << ADC_TRGR_TRGMOD_Pos))
#define   ADC_TRGR_TRGMOD_NO_TRIGGER_Val      _U_(0x0)                                             /**< (ADC_TRGR) No trigger, only software trigger can start conversions  */
#define   ADC_TRGR_TRGMOD_EXT_TRIG_RISE_Val   _U_(0x1)                                             /**< (ADC_TRGR) External trigger rising edge  */
#define   ADC_TRGR_TRGMOD_EXT_TRIG_FALL_Val   _U_(0x2)                                             /**< (ADC_TRGR) External trigger falling edge  */
#define   ADC_TRGR_TRGMOD_EXT_TRIG_ANY_Val    _U_(0x3)                                             /**< (ADC_TRGR) External trigger any edge  */
#define   ADC_TRGR_TRGMOD_PEN_TRIG_Val        _U_(0x4)                                             /**< (ADC_TRGR) Pen Detect Trigger (shall be selected only if PENDET is set and TSAMOD = Touchscreen only mode)  */
#define   ADC_TRGR_TRGMOD_PERIOD_TRIG_Val     _U_(0x5)                                             /**< (ADC_TRGR) ADC internal periodic trigger (see field TRGPER)  */
#define   ADC_TRGR_TRGMOD_CONTINUOUS_Val      _U_(0x6)                                             /**< (ADC_TRGR) Continuous mode  */
#define ADC_TRGR_TRGMOD_NO_TRIGGER            (ADC_TRGR_TRGMOD_NO_TRIGGER_Val << ADC_TRGR_TRGMOD_Pos) /**< (ADC_TRGR) No trigger, only software trigger can start conversions Position  */
#define ADC_TRGR_TRGMOD_EXT_TRIG_RISE         (ADC_TRGR_TRGMOD_EXT_TRIG_RISE_Val << ADC_TRGR_TRGMOD_Pos) /**< (ADC_TRGR) External trigger rising edge Position  */
#define ADC_TRGR_TRGMOD_EXT_TRIG_FALL         (ADC_TRGR_TRGMOD_EXT_TRIG_FALL_Val << ADC_TRGR_TRGMOD_Pos) /**< (ADC_TRGR) External trigger falling edge Position  */
#define ADC_TRGR_TRGMOD_EXT_TRIG_ANY          (ADC_TRGR_TRGMOD_EXT_TRIG_ANY_Val << ADC_TRGR_TRGMOD_Pos) /**< (ADC_TRGR) External trigger any edge Position  */
#define ADC_TRGR_TRGMOD_PEN_TRIG              (ADC_TRGR_TRGMOD_PEN_TRIG_Val << ADC_TRGR_TRGMOD_Pos) /**< (ADC_TRGR) Pen Detect Trigger (shall be selected only if PENDET is set and TSAMOD = Touchscreen only mode) Position  */
#define ADC_TRGR_TRGMOD_PERIOD_TRIG           (ADC_TRGR_TRGMOD_PERIOD_TRIG_Val << ADC_TRGR_TRGMOD_Pos) /**< (ADC_TRGR) ADC internal periodic trigger (see field TRGPER) Position  */
#define ADC_TRGR_TRGMOD_CONTINUOUS            (ADC_TRGR_TRGMOD_CONTINUOUS_Val << ADC_TRGR_TRGMOD_Pos) /**< (ADC_TRGR) Continuous mode Position  */
#define ADC_TRGR_TRGPER_Pos                   _U_(16)                                              /**< (ADC_TRGR) Trigger Period Position */
#define ADC_TRGR_TRGPER_Msk                   (_U_(0xFFFF) << ADC_TRGR_TRGPER_Pos)                 /**< (ADC_TRGR) Trigger Period Mask */
#define ADC_TRGR_TRGPER(value)                (ADC_TRGR_TRGPER_Msk & ((value) << ADC_TRGR_TRGPER_Pos))
#define ADC_TRGR_Msk                          _U_(0xFFFF0007)                                      /**< (ADC_TRGR) Register Mask  */


/* -------- ADC_CVR : (ADC Offset: 0xD4) (R/W 32) Correction Values Register -------- */
#define ADC_CVR_OFFSETCORR_Pos                _U_(0)                                               /**< (ADC_CVR) Offset Correction Position */
#define ADC_CVR_OFFSETCORR_Msk                (_U_(0xFFFF) << ADC_CVR_OFFSETCORR_Pos)              /**< (ADC_CVR) Offset Correction Mask */
#define ADC_CVR_OFFSETCORR(value)             (ADC_CVR_OFFSETCORR_Msk & ((value) << ADC_CVR_OFFSETCORR_Pos))
#define ADC_CVR_GAINCORR_Pos                  _U_(16)                                              /**< (ADC_CVR) Gain Correction Position */
#define ADC_CVR_GAINCORR_Msk                  (_U_(0xFFFF) << ADC_CVR_GAINCORR_Pos)                /**< (ADC_CVR) Gain Correction Mask */
#define ADC_CVR_GAINCORR(value)               (ADC_CVR_GAINCORR_Msk & ((value) << ADC_CVR_GAINCORR_Pos))
#define ADC_CVR_Msk                           _U_(0xFFFFFFFF)                                      /**< (ADC_CVR) Register Mask  */


/* -------- ADC_CECR : (ADC Offset: 0xD8) (R/W 32) Channel Error Correction Register -------- */
#define ADC_CECR_ECORR0_Pos                   _U_(0)                                               /**< (ADC_CECR) Error Correction Enable for channel 0 Position */
#define ADC_CECR_ECORR0_Msk                   (_U_(0x1) << ADC_CECR_ECORR0_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 0 Mask */
#define ADC_CECR_ECORR0(value)                (ADC_CECR_ECORR0_Msk & ((value) << ADC_CECR_ECORR0_Pos))
#define ADC_CECR_ECORR1_Pos                   _U_(1)                                               /**< (ADC_CECR) Error Correction Enable for channel 1 Position */
#define ADC_CECR_ECORR1_Msk                   (_U_(0x1) << ADC_CECR_ECORR1_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 1 Mask */
#define ADC_CECR_ECORR1(value)                (ADC_CECR_ECORR1_Msk & ((value) << ADC_CECR_ECORR1_Pos))
#define ADC_CECR_ECORR2_Pos                   _U_(2)                                               /**< (ADC_CECR) Error Correction Enable for channel 2 Position */
#define ADC_CECR_ECORR2_Msk                   (_U_(0x1) << ADC_CECR_ECORR2_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 2 Mask */
#define ADC_CECR_ECORR2(value)                (ADC_CECR_ECORR2_Msk & ((value) << ADC_CECR_ECORR2_Pos))
#define ADC_CECR_ECORR3_Pos                   _U_(3)                                               /**< (ADC_CECR) Error Correction Enable for channel 3 Position */
#define ADC_CECR_ECORR3_Msk                   (_U_(0x1) << ADC_CECR_ECORR3_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 3 Mask */
#define ADC_CECR_ECORR3(value)                (ADC_CECR_ECORR3_Msk & ((value) << ADC_CECR_ECORR3_Pos))
#define ADC_CECR_ECORR4_Pos                   _U_(4)                                               /**< (ADC_CECR) Error Correction Enable for channel 4 Position */
#define ADC_CECR_ECORR4_Msk                   (_U_(0x1) << ADC_CECR_ECORR4_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 4 Mask */
#define ADC_CECR_ECORR4(value)                (ADC_CECR_ECORR4_Msk & ((value) << ADC_CECR_ECORR4_Pos))
#define ADC_CECR_ECORR5_Pos                   _U_(5)                                               /**< (ADC_CECR) Error Correction Enable for channel 5 Position */
#define ADC_CECR_ECORR5_Msk                   (_U_(0x1) << ADC_CECR_ECORR5_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 5 Mask */
#define ADC_CECR_ECORR5(value)                (ADC_CECR_ECORR5_Msk & ((value) << ADC_CECR_ECORR5_Pos))
#define ADC_CECR_ECORR6_Pos                   _U_(6)                                               /**< (ADC_CECR) Error Correction Enable for channel 6 Position */
#define ADC_CECR_ECORR6_Msk                   (_U_(0x1) << ADC_CECR_ECORR6_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 6 Mask */
#define ADC_CECR_ECORR6(value)                (ADC_CECR_ECORR6_Msk & ((value) << ADC_CECR_ECORR6_Pos))
#define ADC_CECR_ECORR7_Pos                   _U_(7)                                               /**< (ADC_CECR) Error Correction Enable for channel 7 Position */
#define ADC_CECR_ECORR7_Msk                   (_U_(0x1) << ADC_CECR_ECORR7_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 7 Mask */
#define ADC_CECR_ECORR7(value)                (ADC_CECR_ECORR7_Msk & ((value) << ADC_CECR_ECORR7_Pos))
#define ADC_CECR_ECORR8_Pos                   _U_(8)                                               /**< (ADC_CECR) Error Correction Enable for channel 8 Position */
#define ADC_CECR_ECORR8_Msk                   (_U_(0x1) << ADC_CECR_ECORR8_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 8 Mask */
#define ADC_CECR_ECORR8(value)                (ADC_CECR_ECORR8_Msk & ((value) << ADC_CECR_ECORR8_Pos))
#define ADC_CECR_ECORR9_Pos                   _U_(9)                                               /**< (ADC_CECR) Error Correction Enable for channel 9 Position */
#define ADC_CECR_ECORR9_Msk                   (_U_(0x1) << ADC_CECR_ECORR9_Pos)                    /**< (ADC_CECR) Error Correction Enable for channel 9 Mask */
#define ADC_CECR_ECORR9(value)                (ADC_CECR_ECORR9_Msk & ((value) << ADC_CECR_ECORR9_Pos))
#define ADC_CECR_ECORR10_Pos                  _U_(10)                                              /**< (ADC_CECR) Error Correction Enable for channel 10 Position */
#define ADC_CECR_ECORR10_Msk                  (_U_(0x1) << ADC_CECR_ECORR10_Pos)                   /**< (ADC_CECR) Error Correction Enable for channel 10 Mask */
#define ADC_CECR_ECORR10(value)               (ADC_CECR_ECORR10_Msk & ((value) << ADC_CECR_ECORR10_Pos))
#define ADC_CECR_ECORR11_Pos                  _U_(11)                                              /**< (ADC_CECR) Error Correction Enable for channel 11 Position */
#define ADC_CECR_ECORR11_Msk                  (_U_(0x1) << ADC_CECR_ECORR11_Pos)                   /**< (ADC_CECR) Error Correction Enable for channel 11 Mask */
#define ADC_CECR_ECORR11(value)               (ADC_CECR_ECORR11_Msk & ((value) << ADC_CECR_ECORR11_Pos))
#define ADC_CECR_Msk                          _U_(0x00000FFF)                                      /**< (ADC_CECR) Register Mask  */

#define ADC_CECR_ECORR_Pos                    _U_(0)                                               /**< (ADC_CECR Position) Error Correction Enable for channel xx */
#define ADC_CECR_ECORR_Msk                    (_U_(0xFFF) << ADC_CECR_ECORR_Pos)                   /**< (ADC_CECR Mask) ECORR */
#define ADC_CECR_ECORR(value)                 (ADC_CECR_ECORR_Msk & ((value) << ADC_CECR_ECORR_Pos)) 

